In [1]:
import pandas as pd
df = pd.read_csv("Shopping Mall Customer Segmentation Data .csv")
df.head()

,Customer ID,Age,Gender,Annual Income,Spending Score
0,d410ea53-6661-42a9-ad3a-f554b05fd2a7,30,Male,151479,89
1,1770b26f-493f-46b6-837f-4237fb5a314e,58,Female,185088,95
2,e81aa8eb-1767-4b77-87ce-1620dc732c5e,62,Female,70912,76
3,9795712a-ad19-47bf-8886-4f997d6046e3,23,Male,55460,57
4,64139426-2226-4cd6-bf09-91bce4b4db5e,24,Male,153752,76

In [2]:
df.mean(numeric_only=True)

Age                   54.191591
Annual Income     109742.880562
Spending Score        50.591617
dtype: float64

In [3]:
df.median(numeric_only=True)

Age                   54.0
Annual Income     109190.0
Spending Score        51.0
dtype: float64

In [4]:
df.mode()

,Customer ID,Age,Gender,Annual Income,Spending Score
0,000b81bd-76fe-4c9a-8c23-cafa695ee51c,86.0,Male,38434.0,59.0
1,000c39f7-e7fd-4152-964c-3df69159d5c1,NaN,NaN,43020.0,NaN
2,000e3ff3-5342-460e-8576-64223122666f,NaN,NaN,43250.0,NaN
3,0013ced9-6c2c-42dc-b882-3d7555c250c2,NaN,NaN,49997.0,NaN
4,0015128e-5ee8-496e-b14f-d75fd6127a19,NaN,NaN,62455.0,NaN
...,...,...,...,...,...
15074,ffe61482-d934-4f0f-8d8e-a871f3cda1d6,NaN,NaN,NaN,NaN
15075,ffe9a7cb-be8e-49a8-97e1-2ac46561f538,NaN,NaN,NaN,NaN
15076,fff2ea32-17fc-4331-8186-f05728bf6b84,NaN,NaN,NaN,NaN
15077,fffa24f6-7f30-4a63-b1d6-e95004a080b8,NaN,NaN,NaN,NaN
15078,fffb7aa3-2653-40d7-a23c-b32fa5686a9a,NaN,NaN,NaN,NaN

In [5]:
df.describe()

                Age  Annual Income  Spending Score
count  15079.000000   15079.000000    15079.000000
mean      54.191591  109742.880562       50.591617
std       21.119207   52249.425866       28.726977
min       18.000000   20022.000000        1.000000
25%       36.000000   64141.000000       26.000000
50%       54.000000  109190.000000       51.000000
75%       72.000000  155008.000000       75.000000
max       90.000000  199974.000000      100.000000

In [6]:
df.std(numeric_only=True)

Age                  21.119207
Annual Income     52249.425866
Spending Score       28.726977
dtype: float64

In [7]:
df.min(numeric_only=True)

Age                  18
Annual Income     20022
Spending Score        1
dtype: int64

In [9]:
df.groupby("Gender")["Age"].mean()

Gender
Female    54.148316
Male      54.234233
Name: Age, dtype: float64

In [10]:
df.describe()

                Age  Annual Income  Spending Score
count  15079.000000   15079.000000    15079.000000
mean      54.191591  109742.880562       50.591617
std       21.119207   52249.425866       28.726977
min       18.000000   20022.000000        1.000000
25%       36.000000   64141.000000       26.000000
50%       54.000000  109190.000000       51.000000
75%       72.000000  155008.000000       75.000000
max       90.000000  199974.000000      100.000000

In [11]:
df.loc[:,'Age'].mean()

54.191590954307316

In [12]:
df.mean(axis=1, numeric_only=True)[0:4]

0    50532.666667
1    61747.000000
2    23683.333333
3    18513.333333
dtype: float64

In [13]:
df.loc[:,'Age'].max(skipna = False)

90

In [14]:
df.std(numeric_only=True)

Age                  21.119207
Annual Income     52249.425866
Spending Score       28.726977
dtype: float64

In [15]:
df.loc[:,'Age'].std()

21.119207468798695

In [16]:
df.std(axis=1,numeric_only=True)[0:4]

0     87422.094063
1    106816.440930
2     40901.225719
3     31996.756435
dtype: float64

In [18]:
df.groupby(['Gender'])['Age'].mean()

Gender
Female    54.148316
Male      54.234233
Name: Age, dtype: float64

In [19]:
df_u = df.rename(columns={'Annual Income (k$)': 'Income'}, inplace=False)

In [25]:
df_u.groupby('Gender')['Annual Income (k$)'].mean()

KeyError: 'Column not found: Annual Income (k$)'

In [26]:
from sklearn import preprocessing

enc = preprocessing.OneHotEncoder()

enc_df = pd.DataFrame(enc.fit_transform(df[['Gender']]).toarray())

enc_df

         0    1
0      0.0  1.0
1      1.0  0.0
2      1.0  0.0
3      0.0  1.0
4      0.0  1.0
...    ...  ...
15074  1.0  0.0
15075  0.0  1.0
15076  1.0  0.0
15077  1.0  0.0
15078  0.0  1.0

[15079 rows x 2 columns]

In [27]:
df_encode = df.join(enc_df)

df_encode

,Customer ID,Age,Gender,Annual Income,Spending Score,0,1
0,d410ea53-6661-42a9-ad3a-f554b05fd2a7,30,Male,151479,89,0.0,1.0
1,1770b26f-493f-46b6-837f-4237fb5a314e,58,Female,185088,95,1.0,0.0
2,e81aa8eb-1767-4b77-87ce-1620dc732c5e,62,Female,70912,76,1.0,0.0
3,9795712a-ad19-47bf-8886-4f997d6046e3,23,Male,55460,57,0.0,1.0
4,64139426-2226-4cd6-bf09-91bce4b4db5e,24,Male,153752,76,0.0,1.0
...,...,...,...,...,...,...,...
15074,a0504768-a85f-4930-ac24-55bc8e4fec9e,29,Female,97723,30,1.0,0.0
15075,a08c4e0e-d1fe-48e7-9366-aab11ae409cd,22,Male,73361,74,0.0,1.0
15076,0e87c25a-268c-401a-8ba1-7111dcde6f1a,18,Female,112337,48,1.0,0.0
15077,5f388cbe-3373-4e16-b743-38f508f2249f,26,Female,94312,5,1.0,0.0
15078,b8b8f561-ebca-4401-8afe-544c906554ba,19,Male,78045,2,0.0,1.0